# Assignment 1 - Task 1

'\nRead the dataset from the below link\nhttps://raw.githubusercontent.com/guipsamora/pandas_exercises/master/06_Stats/US_Baby_\nNames/US_Baby_Names_right.csv\n\nQuestions:\n1. Delete unnamed columns\n2. Show the distribution of male and female\n3. Show the top 5 most preferred names\n4. What is the median name occurence in the dataset\n5. Distribution of male and female born count by states\n\n'

In [ ]:
"""
Read the dataset from the below link
https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/06_Stats/US_Baby_
Names/US_Baby_Names_right.csv

Questions:
1. Delete unnamed columns
2. Show the distribution of male and female
3. Show the top 5 most preferred names
4. What is the median name occurence in the dataset
5. Distribution of male and female born count by states

"""

In [2]:
#Read the dataset from the below link
import pandas as pd
import numpy as np

In [6]:
#Read the dataset from the below link
df = pd.read_csv('https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/06_Stats/US_Baby_Names/US_Baby_Names_right.csv')
df.head()

   Unnamed: 0     Id     Name  Year Gender State  Count
0       11349  11350     Emma  2004      F    AK     62
1       11350  11351  Madison  2004      F    AK     48
2       11351  11352   Hannah  2004      F    AK     46
3       11352  11353    Grace  2004      F    AK     44
4       11353  11354    Emily  2004      F    AK     41

In [4]:
#1. Delete unnamed columns

df=df.loc[:, ~df.columns.str.contains('^Unnamed')]
df.head()

      Id     Name  Year Gender State  Count
0  11350     Emma  2004      F    AK     62
1  11351  Madison  2004      F    AK     48
2  11352   Hannah  2004      F    AK     46
3  11353    Grace  2004      F    AK     44
4  11354    Emily  2004      F    AK     41

In [5]:
#2. Show the distribution of male and female
df.groupby('Gender').count()

            Id    Name    Year   State   Count
Gender
F       558846  558846  558846  558846  558846
M       457549  457549  457549  457549  457549

In [7]:
#2. Show the distribution of male and femalez
df.Gender.value_counts('F')

F    0.549832
M    0.450168
Name: Gender, dtype: float64

In [8]:
#3. Show the top 5 most preferred names
df.Name.value_counts().head()

Riley     1112
Avery     1080
Jordan    1073
Peyton    1064
Hayden    1049
Name: Name, dtype: int64

In [9]:
#4. What is the median name occurence in the dataset

medianid =  (np.where(df.Id == df.Id.median()))
print (medianid)
NameinMedianid = df.loc[medianid]
print (NameinMedianid)

(array([508197]),)
        Unnamed: 0       Id   Name  Year Gender State  Count
508197     2811920  2811921  Kasey  2010      F    MO      6

In [10]:
#5. Distribution of male and female born count by states

pd.crosstab(index=df.Gender,columns=df.State)

State,AK,AL,AR,AZ,CA,CO,CT,DC,DE,FL,...,SD,TN,TX,UT,VA,VT,WA,WI,WV,WY
Gender,,,,,,,,,,,,,,,,,,,,,
F,2404,9878,7171,14518,45144,11424,6575,3053,2549,25781,...,2838,13063,39760,9515,14759,1398,13329,10549,4305,1456
M,2587,8419,6475,10820,31637,9183,5733,3000,2440,20070,...,2908,10588,27791,8233,11997,1618,11049,8940,3733,1904